---
kind: other
id: Properties.T:Autodesk.Revit.DB.ReferenceArrayIterator
source: html/2daa0d83-2248-6495-25f9-2e74b2b2c806.htm
---
# ReferenceArrayIterator Properties

Retrieves the item that is the current focus of the iterator.